do
 function run(msg, matches)
local text = [[ 
>>لیست ابزار های آواست:
_____________________
»دریافت متن تبلیغ
تبلیغ

»دریافت وضعیت ارز
!arz

»دریافت اوقات شرعی
!praytime [نام شهر]

»دریافت عکس های P.o.r.n
!boobs

»دریافت شماره ربات
!share

»انجام محاسبات ریاضی
!calc 2+2

»دریافت عکس قاره
نام قاره مورد نطر را به زبان فارسی ارسال کنید

»تکرار متن
!echo [متن]

»دانلود عکس
لینک عکس را بفرستید و بات بصورت خودکار برای شما دانلود و ارسال میکند

»برای فیلتر کردن کلمه
filter + [کلمه]
و برای خارج کردن از فیلتر
filter - [کلمه]

»برای دیدن درباره خود
!info
!aboutme

»برای مشاهده اطلاعات یک اکانت گیت هاب
github [نام پروژه] [نام گیت هاب] 

»برای جستوجو در گوگل
!google [متن]

»برای مشاهده راهنما کامل
helps

»برای نوشتن بر روی عکس
!meme [متن] [موضوع پس زمینه]

»برای دیدن مقام خود
!me

»برای تبدیل متن به عکس کیو آر کد
!qr [متن]

»برای تنظیم لینک
!setlink [لینک] [نام گروه]
و برای دریافت لینک
!get [نام گروه]

»برای دیدن درباره خود
!info

»برای کار با آیپی
ip
config [ip]
ping [ip]
getip

»(برای دریافت لینک گروه در خصوصی(لطفا برای جلوگیری از ریپورت شدن ربات شماره ربات را ذخیره کنید
!linkpv

»برای دریافت نقشه یک مکان
!loc [نام مکان]

»برای ارسال پیام به تمام اعضای گروه
!s2a [متن]

»برای اسپم دادن از طرف ربات
!spam [متن اسپم] [تعداد]
Avast [متن اسپم] [تعداد]

»برای دریافت پشتیبانی پیشرفته
!support

»برای دریافت یوزرنیم تمام کاربران
!tagall .

»برای تبدیل متن به عکس
!tex [متن]

»برای دریافت زمان
!time [نام شهر]

»برای ترجمه متن
!tr [متن]

»برای جستوجو در ویکی پدیا
!wiki [موضوع]

»برای کار با زیبا نویس
write [متن]

»برای دیدن اعضای تیم آواست  تنها مدیران تیم
vcard

»برای دیدن متن درباره ربات
!version
!avast

»تبدیل متن به صدا
!voice [متن]

»برای امتیاز دادن به ربات
!vote [عدد]

»برای دریافت اب و هوا
!weather [نام شهر]

»برای دریافت اسکرین شات از یک سایت
/web [آدرس سایت]

»برای دریافت موج رادیو
نام رادیو را بفرستید

»دریافت خدمات ایرانسل
!irancell

»دریافت کد های مخفی اندروید
!secretcode
________________________
>>برای دریافت اطلاعات بیشتر در @avast_Team عضو شوید
]]
return text
end
return {
patterns = {
"^[!/#](helppl)$",
},
run = run
}
end
